# IsTranslation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform..::..IsTranslation Property
Transform Class See Also
---
The boolean value that indicates whether this transformation is a translation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsTranslation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsTranslation As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsTranslation {
	bool get ();
}
```

# Remarks
This property is true if the only effect of transformation is translation. It checks that the basis of the transform is identity. The translation vector may be zero (which would make this an identity transformation) or nonzero (which would make this a non-trivial translation).
# See Also
Transform Class
Autodesk.Revit.DB Namespace